In [127]:
import pandas as pd

In [128]:
sales_data = {
    "OrderID": [1001, 1002, 1003, 1004, 1005, 1006, 1007, 1008, 1009, 1010],
    "CustomerID": ['C001', 'C002', 'C003', 'C004', 'C005', 'C006', 'C007', 'C008', 'C009', 'C010'],
    "CustomerName": [
        'Alice Johnson', 'Bob Smith', 'Carol Lee', 'David Kim', 'Emma Davis',
        'Frank Wilson', 'Grace Chen', 'Henry Patel', 'Irene Lopez', 'Jack Brown'
    ],
    "Segment": [
        'Consumer', 'Corporate', 'Home Office', 'Consumer', 'Corporate',
        'Consumer', 'Home Office', 'Consumer', 'Corporate', 'Consumer'
    ],
    "Region": [
        'East', 'West', 'Central', 'South', 'East',
        'Central', 'West', 'East', 'South', 'Central'
    ],
    "OrderDate": [
        '2025-08-01', '2025-08-03', '2025-08-05', '2025-08-07', '2025-08-09',
        '2025-08-11', '2025-08-13', '2025-08-15', '2025-08-17', '2025-08-19'
    ],
    "ProductCategory": [
        'Furniture', 'Office Supplies', 'Technology', 'Furniture', 'Office Supplies',
        'Technology', 'Furniture', 'Office Supplies', 'Technology', 'Furniture'
    ],
    "SalesAmount": [1200.50, 450.75, 890.00, 670.80, 310.25, 1500.00, 920.45, 540.60, 720.00, 1100.80],
    "Quantity": [2, 5, 1, 3, 4, 2, 1, 6, 3, 4],
    "Discount": [0.10, 0.05, 0.20, 0.15, 0.00, 0.25, 0.05, 0.10, 0.15, 0.20],
    "Profit": [300.12, 90.15, 150.50, 120.30, 70.40, 250.00, 200.10, 130.50, 180.00, 250.00],
    "SalesRep": [
        'William Clark', 'Olivia Martinez', 'James Wilson', 'Olivia Martinez', 'William Clark',
        'James Wilson', 'Olivia Martinez', 'William Clark', 'William Clark', 'Olivia Martinez'
    ]
}
data = pd.DataFrame(sales_data)
data

,OrderID,CustomerID,CustomerName,Segment,Region,OrderDate,ProductCategory,SalesAmount,Quantity,Discount,Profit,SalesRep
0,1001,C001,Alice Johnson,Consumer,East,2025-08-01,Furniture,1200.50,2,0.10,300.12,William Clark
1,1002,C002,Bob Smith,Corporate,West,2025-08-03,Office Supplies,450.75,5,0.05,90.15,Olivia Martinez
2,1003,C003,Carol Lee,Home Office,Central,2025-08-05,Technology,890.00,1,0.20,150.50,James Wilson
3,1004,C004,David Kim,Consumer,South,2025-08-07,Furniture,670.80,3,0.15,120.30,Olivia Martinez
4,1005,C005,Emma Davis,Corporate,East,2025-08-09,Office Supplies,310.25,4,0.00,70.40,William Clark
5,1006,C006,Frank Wilson,Consumer,Central,2025-08-11,Technology,1500.00,2,0.25,250.00,James Wilson
6,1007,C007,Grace Chen,Home Office,West,2025-08-13,Furniture,920.45,1,0.05,200.10,Olivia Martinez
7,1008,C008,Henry Patel,Consumer,East,2025-08-15,Office Supplies,540.60,6,0.10,130.50,William Clark
8,1009,C009,Irene Lopez,Corporate,South,2025-08-17,Technology,720.00,3,0.15,180.00,William Clark
9,1010,C010,Jack Brown,Consumer,Central,2025-08-19,Furniture,1100.80,4,0.20,250.00,Olivia Martinez

In [129]:
data.groupby('ProductCategory')['SalesAmount'].sum()

ProductCategory
Furniture          3892.55
Office Supplies    1301.60
Technology         3110.00
Name: SalesAmount, dtype: float64

In [130]:
data.groupby('SalesRep')['Profit'].sum()

SalesRep
James Wilson       400.50
Olivia Martinez    660.55
William Clark      681.02
Name: Profit, dtype: float64

In [131]:
data.iloc[data['Quantity'].idxmax()]['ProductCategory']

'Office Supplies'

In [132]:
data.groupby('Region')['SalesAmount'].mean()

Region
Central    1163.600000
East        683.783333
South       695.400000
West        685.600000
Name: SalesAmount, dtype: float64

In [133]:
employee_data_dict = {
    "EmployeeID": ['E001','E002','E003','E004','E005','E006','E007','E008','E009','E010'],
    "Name": [
        'Alice Brown', 'Bob Smith', 'Carol Lee', 'David Kim', 'Emma Davis',
        'Frank Wilson', 'Grace Chen', 'Henry Patel', 'Irene Lopez', 'Jack Brown'
    ],
    "Department": [
        'HR', 'IT', 'Finance', 'IT', 'Marketing',
        'HR', 'Finance', 'Marketing', 'IT', 'HR'
    ],
    "Salary": [55000, 72000, 68000, 75000, 50000, 53000, 67000, 52000, 71000, 56000],
    "PerformanceScore": [8.5, 7.2, 9.0, 6.5, 8.0, 7.8, 8.9, 7.5, 9.3, 6.8]
}
data = pd.DataFrame(employee_data_dict)
data

  EmployeeID          Name Department  Salary  PerformanceScore
0       E001   Alice Brown         HR   55000               8.5
1       E002     Bob Smith         IT   72000               7.2
2       E003     Carol Lee    Finance   68000               9.0
3       E004     David Kim         IT   75000               6.5
4       E005    Emma Davis  Marketing   50000               8.0
5       E006  Frank Wilson         HR   53000               7.8
6       E007    Grace Chen    Finance   67000               8.9
7       E008   Henry Patel  Marketing   52000               7.5
8       E009   Irene Lopez         IT   71000               9.3
9       E010    Jack Brown         HR   56000               6.8

In [134]:
# print(data.groupby('Department')['EmployeeID'].count())
# data.iloc[data['Salary'].idxmax()]
# print(data.groupby('Department')['Salary'].mean())
print(data.sort_values('Salary'))

  EmployeeID          Name Department  Salary  PerformanceScore
4       E005    Emma Davis  Marketing   50000               8.0
7       E008   Henry Patel  Marketing   52000               7.5
5       E006  Frank Wilson         HR   53000               7.8
0       E001   Alice Brown         HR   55000               8.5
9       E010    Jack Brown         HR   56000               6.8
6       E007    Grace Chen    Finance   67000               8.9
2       E003     Carol Lee    Finance   68000               9.0
8       E009   Irene Lopez         IT   71000               9.3
1       E002     Bob Smith         IT   72000               7.2
3       E004     David Kim         IT   75000               6.5

In [135]:
student_data_dict = {
    "StudentID": ['S001', 'S002', 'S003', 'S004', 'S005', 'S006', 'S007', 'S008', 'S009', 'S010'],
    "Name": [
        'Alice Brown', 'Bob Smith', 'Carol Lee', 'David Kim', 'Emma Davis',
        'Frank Wilson', 'Grace Chen', 'Henry Patel', 'Irene Lopez', 'Jack Brown'
    ],
    "Math": [85, 58, 95, 76, 66, 90, 72, 81, 69, 88],
    "Science": [78, 64, 18, 85, 72, 95, 10, 79, 14, 10],
    "English": [92, 10, 82, 20, 68, 88, 75, 85, 17, 86],
    "History": [74, 66, 91, 79, 70, 92, 65, 80, 71, 19],
    "Class": ['Class A', 'Class A', 'Class B', 'Class B', 'Class A', 'Class C', 'Class C', 'Class B', 'Class A', 'Class C']
}
data = pd.DataFrame(student_data_dict)
data

  StudentID          Name  Math  Science  English  History    Class
0      S001   Alice Brown    85       78       92       74  Class A
1      S002     Bob Smith    58       64       10       66  Class A
2      S003     Carol Lee    95       18       82       91  Class B
3      S004     David Kim    76       85       20       79  Class B
4      S005    Emma Davis    66       72       68       70  Class A
5      S006  Frank Wilson    90       95       88       92  Class C
6      S007    Grace Chen    72       10       75       65  Class C
7      S008   Henry Patel    81       79       85       80  Class B
8      S009   Irene Lopez    69       14       17       71  Class A
9      S010    Jack Brown    88       10       86       19  Class C

In [136]:
# data['total'] = data.iloc[:,2:-1].sum(axis=1)

In [137]:
# data.groupby('Class')['StudentID'].count()
# data.iloc[:,2:-1].mean(axis=0)
# data.iloc[data['total'].idxmax()]
# data[(data.iloc[:,2:-2]<40).any(axis=1)]

(data.iloc[:,2:-2]<40).any(axis=1)

0    False
1     True
2     True
3     True
4    False
5    False
6     True
7    False
8     True
9     True
dtype: bool

In [138]:
import pandas as pd

ecommerce_orders_dict = {
    "OrderID": list(range(101, 121)),
    "CustomerID": ['C001', 'C002', 'C003', 'C001', 'C004', 'C005', 'C002', 'C003', 'C001', 'C004',
                   'C005', 'C006', 'C007', 'C008', 'C001', 'C002', 'C003', 'C006', 'C007', 'C008'],
    "CustomerName": ['Alice', 'Bob', 'Carol', 'Alice', 'David', 'Emma', 'Bob', 'Carol', 'Alice', 'David',
                     'Emma', 'Frank', 'Grace', 'Henry', 'Alice', 'Bob', 'Carol', 'Frank', 'Grace', 'Henry'],
    "Product": ['Laptop', 'Mouse', 'Keyboard', 'Monitor', 'Laptop', 'Mouse', 'Laptop', 'Keyboard', 'Mouse', 'Monitor',
                'Keyboard', 'Headphones', 'Smartphone', 'Tablet', 'Laptop', 'Headphones', 'Keyboard', 'Smartphone', 'Tablet', 'Monitor'],
    "Quantity": [1, 2, 1, 1, 2, 3, 1, 2, 1, 1, 2, 1, 1, 1, 1, 2, 1, 1, 2, 1],
    "Price": [1200, 25, 45, 200, 1150, 20, 1250, 50, 25, 210, 45, 100, 800, 400, 1300, 100, 50, 750, 420, 210]
}

data = pd.DataFrame(ecommerce_orders_dict)
data

    OrderID CustomerID CustomerName     Product  Quantity  Price
0       101       C001        Alice      Laptop         1   1200
1       102       C002          Bob       Mouse         2     25
2       103       C003        Carol    Keyboard         1     45
3       104       C001        Alice     Monitor         1    200
4       105       C004        David      Laptop         2   1150
5       106       C005         Emma       Mouse         3     20
6       107       C002          Bob      Laptop         1   1250
7       108       C003        Carol    Keyboard         2     50
8       109       C001        Alice       Mouse         1     25
9       110       C004        David     Monitor         1    210
10      111       C005         Emma    Keyboard         2     45
11      112       C006        Frank  Headphones         1    100
12      113       C007        Grace  Smartphone         1    800
13      114       C008        Henry      Tablet         1    400
14      115       C001        Alice      Laptop         1   1300
15      116       C002          Bob  Headphones         2    100
16      117       C003        Carol    Keyboard         1     50
17      118       C006        Frank  Smartphone         1    750
18      119       C007        Grace      Tablet         2    420
19      120       C008        Henry     Monitor         1    210

In [139]:
data.groupby('CustomerID')['OrderID'].count()

CustomerID
C001    4
C002    3
C003    3
C004    2
C005    2
C006    2
C007    2
C008    2
Name: OrderID, dtype: int64

In [140]:
data.groupby('CustomerID')['OrderID'].count().idxmax()

'C001'

In [141]:
data['totalamount'] = data['Quantity']*data['Price']

In [142]:
data.groupby('Product')['totalamount'].sum()

Product
Headphones     300
Keyboard       285
Laptop        6050
Monitor        620
Mouse          135
Smartphone    1550
Tablet        1240
Name: totalamount, dtype: int64

In [143]:
data.groupby('Product')['Quantity'].sum().sort_values(ascending=False)[0:5]

Product
Keyboard      6
Mouse         6
Laptop        5
Headphones    3
Monitor       3
Name: Quantity, dtype: int64

In [144]:
import pandas as pd

hospital_data_dict = {
    "PatientID": ['P001', 'P002', 'P003', 'P004', 'P005', 'P006', 'P007', 'P008', 'P009', 'P010', 'P011', 'P012'],
    "PatientName": ['Alice Brown', 'Bob Smith', 'Carol Lee', 'David Kim', 'Emma Davis', 'Frank Wilson', 
                    'Grace Chen', 'Henry Patel', 'Irene Lopez', 'Jack Brown', 'Laura White', 'Mike Green'],
    "Department": ['Cardiology', 'Neurology', 'Orthopedics', 'Cardiology', 'Pediatrics', 'Neurology', 
                   'Orthopedics', 'Cardiology', 'Pediatrics', 'Neurology', 'Orthopedics', 'Cardiology'],
    "AdmissionDate": ['2025-01-05', '2025-01-10', '2025-02-15', '2025-03-01', '2025-03-05', '2025-04-12', 
                      '2025-04-20', '2025-05-03', '2025-05-10', '2025-06-15', '2025-06-20', '2025-07-01'],
    "DischargeDate": ['2025-01-12', '2025-01-20', '2025-02-25', '2025-03-10', '2025-03-12', '2025-04-22', 
                      '2025-04-28', '2025-05-10', '2025-05-15', '2025-06-25', '2025-06-28', '2025-07-10'],
    "HospitalStayDays": [7, 10, 10, 9, 7, 10, 8, 7, 5, 10, 8, 9]
}

data = pd.DataFrame(hospital_data_dict)
data

,PatientID,PatientName,Department,AdmissionDate,DischargeDate,HospitalStayDays
0,P001,Alice Brown,Cardiology,2025-01-05,2025-01-12,7
1,P002,Bob Smith,Neurology,2025-01-10,2025-01-20,10
2,P003,Carol Lee,Orthopedics,2025-02-15,2025-02-25,10
3,P004,David Kim,Cardiology,2025-03-01,2025-03-10,9
4,P005,Emma Davis,Pediatrics,2025-03-05,2025-03-12,7
5,P006,Frank Wilson,Neurology,2025-04-12,2025-04-22,10
6,P007,Grace Chen,Orthopedics,2025-04-20,2025-04-28,8
7,P008,Henry Patel,Cardiology,2025-05-03,2025-05-10,7
8,P009,Irene Lopez,Pediatrics,2025-05-10,2025-05-15,5
9,P010,Jack Brown,Neurology,2025-06-15,2025-06-25,10
10,P011,Laura White,Orthopedics,2025-06-20,2025-06-28,8
11,P012,Mike Green,Cardiology,2025-07-01,2025-07-10,9

In [145]:
data.groupby('Department')['PatientID'].count()

Department
Cardiology     4
Neurology      3
Orthopedics    3
Pediatrics     2
Name: PatientID, dtype: int64

In [146]:

data['AdmissionDate'] = pd.to_datetime(data['AdmissionDate'])
data.groupby('Department')['HospitalStayDays'].mean().round(1)

Department
Cardiology      8.0
Neurology      10.0
Orthopedics     8.7
Pediatrics      6.0
Name: HospitalStayDays, dtype: float64

In [ ]:
data.iloc[data['HospitalStayDays'].idxmax()]['PatientName']

'Bob Smith'

In [150]:
data.groupby(data['AdmissionDate'].dt.to_period('M'))['PatientID'].count()

AdmissionDate
2025-01    2
2025-02    1
2025-03    2
2025-04    2
2025-05    2
2025-06    2
2025-07    1
Freq: M, Name: PatientID, dtype: int64

In [151]:
bank_transactions_dict = {
    "TransactionID": ['T001', 'T002', 'T003', 'T004', 'T005', 'T006', 'T007', 'T008', 'T009', 'T010', 'T011', 'T012'],
    "AccountID": ['A001', 'A002', 'A001', 'A003', 'A002', 'A001', 'A004', 'A003', 'A004', 'A002', 'A003', 'A001'],
    "CustomerName": ['Alice', 'Bob', 'Alice', 'Carol', 'Bob', 'Alice', 'David', 'Carol', 'David', 'Bob', 'Carol', 'Alice'],
    "TransactionType": ['Deposit', 'Withdrawal', 'Deposit', 'Deposit', 'Withdrawal', 'Withdrawal', 'Deposit', 'Withdrawal', 'Deposit', 'Deposit', 'Withdrawal', 'Deposit'],
    "TransactionAmount": [1200, 500, 1500, 2000, 700, 600, 3000, 1000, 2500, 1200, 800, 1800],
    "TransactionDate": ['2025-01-05', '2025-01-07', '2025-01-10', '2025-02-01', '2025-02-05', '2025-02-10',
                        '2025-03-03', '2025-03-10', '2025-03-15', '2025-04-01', '2025-04-05', '2025-04-10']
}
data = pd.DataFrame(bank_transactions_dict)
data

,TransactionID,AccountID,CustomerName,TransactionType,TransactionAmount,TransactionDate
0,T001,A001,Alice,Deposit,1200,2025-01-05
1,T002,A002,Bob,Withdrawal,500,2025-01-07
2,T003,A001,Alice,Deposit,1500,2025-01-10
3,T004,A003,Carol,Deposit,2000,2025-02-01
4,T005,A002,Bob,Withdrawal,700,2025-02-05
5,T006,A001,Alice,Withdrawal,600,2025-02-10
6,T007,A004,David,Deposit,3000,2025-03-03
7,T008,A003,Carol,Withdrawal,1000,2025-03-10
8,T009,A004,David,Deposit,2500,2025-03-15
9,T010,A002,Bob,Deposit,1200,2025-04-01
10,T011,A003,Carol,Withdrawal,800,2025-04-05
11,T012,A001,Alice,Deposit,1800,2025-04-10

In [152]:
data.groupby('AccountID')['TransactionID'].count()

AccountID
A001    4
A002    3
A003    3
A004    2
Name: TransactionID, dtype: int64

In [ ]:
data.iloc[data['TransactionAmount'].idxmax()]

TransactionID              T007
AccountID                  A004
CustomerName              David
TransactionType         Deposit
TransactionAmount          3000
TransactionDate      2025-03-03
Name: 6, dtype: object

In [155]:
data.groupby('AccountID')['TransactionAmount'].mean()

AccountID
A001    1275.000000
A002     800.000000
A003    1266.666667
A004    2750.000000
Name: TransactionAmount, dtype: float64

In [156]:
data.groupby('TransactionType')['TransactionAmount'].sum()

TransactionType
Deposit       13200
Withdrawal     3600
Name: TransactionAmount, dtype: int64

In [157]:
inventory_dict = {
    "ProductID": ['P001','P002','P003','P004','P005','P006','P007','P008','P009','P010'],
    "Category": ['Beverages','Beverages','Snacks','Snacks','Dairy','Dairy','Bakery','Bakery','Household','Household'],
    "ProductName": [
        'Cola 500ml', 'Orange Juice 1L', 'Potato Chips 200g', 'Chocolate Bar 50g',
        'Milk 1L', 'Cheddar Cheese 200g', 'Whole Wheat Bread', 'Croissant Pack (4)',
        'Laundry Detergent 2kg', 'Dish Soap 500ml'
    ],
    "Stock": [120, 45, 80, 25, 60, 15, 35, 10, 90, 50],
    "ReorderLevel": [50, 60, 40, 30, 40, 20, 25, 15, 30, 20]
}
data = pd.DataFrame(inventory_dict)
data

  ProductID   Category            ProductName  Stock  ReorderLevel
0      P001  Beverages             Cola 500ml    120            50
1      P002  Beverages        Orange Juice 1L     45            60
2      P003     Snacks      Potato Chips 200g     80            40
3      P004     Snacks      Chocolate Bar 50g     25            30
4      P005      Dairy                Milk 1L     60            40
5      P006      Dairy    Cheddar Cheese 200g     15            20
6      P007     Bakery      Whole Wheat Bread     35            25
7      P008     Bakery     Croissant Pack (4)     10            15
8      P009  Household  Laundry Detergent 2kg     90            30
9      P010  Household        Dish Soap 500ml     50            20

In [160]:
data.groupby('Category')['ProductID'].count()

Category
Bakery       2
Beverages    2
Dairy        2
Household    2
Snacks       2
Name: ProductID, dtype: int64

In [ ]:
data.iloc[data['Stock'].idxmin()]['ProductName']

ProductID                     P008
Category                    Bakery
ProductName     Croissant Pack (4)
Stock                           10
ReorderLevel                    15
Name: 7, dtype: object

In [165]:
data.groupby('Category')['Stock'].mean()

Category
Bakery       22.5
Beverages    82.5
Dairy        37.5
Household    70.0
Snacks       52.5
Name: Stock, dtype: float64

In [172]:
print(data[(data['Stock']<30)])

  ProductID Category          ProductName  Stock  ReorderLevel
3      P004   Snacks    Chocolate Bar 50g     25            30
5      P006    Dairy  Cheddar Cheese 200g     15            20
7      P008   Bakery   Croissant Pack (4)     10            15

In [174]:

social_media_data = {
    "PostID": ['P001','P002','P003','P004','P005','P006','P007','P008','P009','P010','P011','P012'],
    "UserID": ['U001','U002','U001','U003','U002','U001','U004','U003','U004','U001','U002','U003'],
    "UserName": ['Alice','Bob','Alice','Carol','Bob','Alice','David','Carol','David','Alice','Bob','Carol'],
    "PostContent": [
        'Had a great day!', 'Check out this photo!', 'New blog post is up', 'Lovely sunset!',
        'Weekend vibes', 'Sharing a tip', 'Throwback Thursday', 'Morning coffee', 'Fitness update',
        'Book recommendation', 'Holiday photos', 'Movie review'
    ],
    "Likes": [120, 85, 150, 200, 90, 130, 50, 110, 75, 160, 95, 180],
    "Comments": [15, 10, 25, 30, 8, 20, 5, 12, 4, 18, 9, 22],
    "PostDate": [
        '2025-08-01','2025-08-02','2025-08-03','2025-08-04','2025-08-05','2025-08-06',
        '2025-08-07','2025-08-08','2025-08-09','2025-08-10','2025-08-11','2025-08-12'
    ]
}

data = pd.DataFrame(social_media_data)
data

   PostID UserID UserName            PostContent  Likes  Comments    PostDate
0    P001   U001    Alice       Had a great day!    120        15  2025-08-01
1    P002   U002      Bob  Check out this photo!     85        10  2025-08-02
2    P003   U001    Alice    New blog post is up    150        25  2025-08-03
3    P004   U003    Carol         Lovely sunset!    200        30  2025-08-04
4    P005   U002      Bob          Weekend vibes     90         8  2025-08-05
5    P006   U001    Alice          Sharing a tip    130        20  2025-08-06
6    P007   U004    David     Throwback Thursday     50         5  2025-08-07
7    P008   U003    Carol         Morning coffee    110        12  2025-08-08
8    P009   U004    David         Fitness update     75         4  2025-08-09
9    P010   U001    Alice    Book recommendation    160        18  2025-08-10
10   P011   U002      Bob         Holiday photos     95         9  2025-08-11
11   P012   U003    Carol           Movie review    180        22  2025-08-12

In [175]:
data.groupby('UserID')['PostID'].count()

UserID
U001    4
U002    3
U003    3
U004    2
Name: PostID, dtype: int64

In [177]:
data.iloc[data['Likes'].idxmax()]['UserName']

'Carol'

In [178]:
data.groupby('UserID')['Likes'].mean()

UserID
U001    140.000000
U002     90.000000
U003    163.333333
U004     62.500000
Name: Likes, dtype: float64

In [188]:
data.loc[data['UserID'] ==data.groupby('UserID')['PostID'].count().idxmax()].iloc[0]

PostID                     P001
UserID                     U001
UserName                  Alice
PostContent    Had a great day!
Likes                       120
Comments                     15
PostDate             2025-08-01
Name: 0, dtype: object

In [189]:
flight_data = {
    "FlightID": ['F001','F002','F003','F004','F005','F006','F007','F008','F009','F010','F011','F012'],
    "Airline": ['AirAlpha','AirBeta','AirAlpha','AirGamma','AirBeta','AirAlpha','AirGamma','AirBeta','AirAlpha','AirGamma','AirBeta','AirAlpha'],
    "Origin": ['New York','Los Angeles','New York','Chicago','Los Angeles','New York','Chicago','Los Angeles','New York','Chicago','Los Angeles','New York'],
    "Destination": ['Chicago','New York','Chicago','New York','Chicago','Miami','Miami','Miami','Miami','Miami','Miami','Miami'],
    "DepartureTime": ['2025-08-01 08:00','2025-08-01 09:00','2025-08-02 10:00','2025-08-02 12:00',
                      '2025-08-03 14:00','2025-08-03 16:00','2025-08-04 08:00','2025-08-04 09:00',
                      '2025-08-05 10:00','2025-08-05 12:00','2025-08-06 14:00','2025-08-06 16:00'],
    "ArrivalTime": ['2025-08-01 11:00','2025-08-01 13:00','2025-08-02 13:00','2025-08-02 15:30',
                    '2025-08-03 17:00','2025-08-03 19:30','2025-08-04 11:30','2025-08-04 12:45',
                    '2025-08-05 13:00','2025-08-05 15:30','2025-08-06 17:30','2025-08-06 18:45'],
    "FlightDurationMinutes": [180, 240, 180, 210, 180, 210, 210, 225, 180, 210, 210, 165],
    "DelayMinutes": [15, 30, 0, 10, 5, 20, 15, 0, 25, 5, 10, 0]
}
data = pd.DataFrame(flight_data)
data

,FlightID,Airline,Origin,Destination,DepartureTime,ArrivalTime,FlightDurationMinutes,DelayMinutes
0,F001,AirAlpha,New York,Chicago,2025-08-01 08:00,2025-08-01 11:00,180,15
1,F002,AirBeta,Los Angeles,New York,2025-08-01 09:00,2025-08-01 13:00,240,30
2,F003,AirAlpha,New York,Chicago,2025-08-02 10:00,2025-08-02 13:00,180,0
3,F004,AirGamma,Chicago,New York,2025-08-02 12:00,2025-08-02 15:30,210,10
4,F005,AirBeta,Los Angeles,Chicago,2025-08-03 14:00,2025-08-03 17:00,180,5
5,F006,AirAlpha,New York,Miami,2025-08-03 16:00,2025-08-03 19:30,210,20
6,F007,AirGamma,Chicago,Miami,2025-08-04 08:00,2025-08-04 11:30,210,15
7,F008,AirBeta,Los Angeles,Miami,2025-08-04 09:00,2025-08-04 12:45,225,0
8,F009,AirAlpha,New York,Miami,2025-08-05 10:00,2025-08-05 13:00,180,25
9,F010,AirGamma,Chicago,Miami,2025-08-05 12:00,2025-08-05 15:30,210,5
10,F011,AirBeta,Los Angeles,Miami,2025-08-06 14:00,2025-08-06 17:30,210,10
11,F012,AirAlpha,New York,Miami,2025-08-06 16:00,2025-08-06 18:45,165,0

In [190]:
data.groupby("Airline")['FlightID'].count()

Airline
AirAlpha    5
AirBeta     4
AirGamma    3
Name: FlightID, dtype: int64

In [191]:
data.groupby("Airline")['DelayMinutes'].mean()

Airline
AirAlpha    12.00
AirBeta     11.25
AirGamma    10.00
Name: DelayMinutes, dtype: float64

In [194]:
data.groupby("Destination")['FlightID'].count().idxmax()

'Miami'

In [199]:
print(data.iloc[data['FlightDurationMinutes'].idxmax()]['Destination'])
print(data.iloc[data['FlightDurationMinutes'].idxmin()]['Destination'])

New York
Miami

In [200]:

movie_ratings_data = {
    "MovieID": [
        'M001','M001','M002','M002','M003','M003','M004','M004','M005','M005',
        'M006','M006','M007','M007','M008','M008','M009','M009','M010','M010',
        'M011','M011','M012','M012','M013','M013','M014','M014','M015','M015'
    ],
    "Title": [
        'The Adventure','The Adventure','Space Journey','Space Journey','Mystery Night','Mystery Night',
        'Love in Paris','Love in Paris','Tech Revolution','Tech Revolution','Hidden Secrets','Hidden Secrets',
        'Comedy Club','Comedy Club','Horror House','Horror House','Drama Tales','Drama Tales','Fantasy World','Fantasy World',
        'Sci-Fi Saga','Sci-Fi Saga','Romantic Escape','Romantic Escape','Thriller Night','Thriller Night','Action Blast','Action Blast','Family Fun','Family Fun'
    ],
    "Genre": [
        'Adventure','Adventure','Sci-Fi','Sci-Fi','Mystery','Mystery','Romance','Romance','Sci-Fi','Sci-Fi',
        'Mystery','Mystery','Comedy','Comedy','Horror','Horror','Drama','Drama','Fantasy','Fantasy',
        'Sci-Fi','Sci-Fi','Romance','Romance','Thriller','Thriller','Action','Action','Family','Family'
    ],
    "Director": [
        'John Smith','John Smith','Alice Brown','Alice Brown','Carol Lee','Carol Lee','David Kim','David Kim',
        'Alice Brown','Alice Brown','Carol Lee','Carol Lee','Emma Davis','Emma Davis','Frank Wilson','Frank Wilson',
        'Grace Chen','Grace Chen','Henry Patel','Henry Patel','Alice Brown','Alice Brown','David Kim','David Kim',
        'Carol Lee','Carol Lee','Emma Davis','Emma Davis','Grace Chen','Grace Chen'
    ],
    "Rating": [
        8.5, 8.8, 9.2, 8.9, 7.8, 8.0, 8.0, 7.9, 9.0, 9.1, 8.1, 7.9, 7.5, 7.8, 6.8, 7.0, 8.3, 8.4, 9.1, 9.0,
        9.3, 9.0, 8.2, 8.1, 7.7, 8.0, 8.5, 8.3, 7.9, 8.1
    ]
}


data = pd.DataFrame(movie_ratings_data)
data

   MovieID            Title      Genre      Director  Rating
0     M001    The Adventure  Adventure    John Smith     8.5
1     M001    The Adventure  Adventure    John Smith     8.8
2     M002    Space Journey     Sci-Fi   Alice Brown     9.2
3     M002    Space Journey     Sci-Fi   Alice Brown     8.9
4     M003    Mystery Night    Mystery     Carol Lee     7.8
5     M003    Mystery Night    Mystery     Carol Lee     8.0
6     M004    Love in Paris    Romance     David Kim     8.0
7     M004    Love in Paris    Romance     David Kim     7.9
8     M005  Tech Revolution     Sci-Fi   Alice Brown     9.0
9     M005  Tech Revolution     Sci-Fi   Alice Brown     9.1
10    M006   Hidden Secrets    Mystery     Carol Lee     8.1
11    M006   Hidden Secrets    Mystery     Carol Lee     7.9
12    M007      Comedy Club     Comedy    Emma Davis     7.5
13    M007      Comedy Club     Comedy    Emma Davis     7.8
14    M008     Horror House     Horror  Frank Wilson     6.8
15    M008     Horror House     Horror  Frank Wilson     7.0
16    M009      Drama Tales      Drama    Grace Chen     8.3
17    M009      Drama Tales      Drama    Grace Chen     8.4
18    M010    Fantasy World    Fantasy   Henry Patel     9.1
19    M010    Fantasy World    Fantasy   Henry Patel     9.0
20    M011      Sci-Fi Saga     Sci-Fi   Alice Brown     9.3
21    M011      Sci-Fi Saga     Sci-Fi   Alice Brown     9.0
22    M012  Romantic Escape    Romance     David Kim     8.2
23    M012  Romantic Escape    Romance     David Kim     8.1
24    M013   Thriller Night   Thriller     Carol Lee     7.7
25    M013   Thriller Night   Thriller     Carol Lee     8.0
26    M014     Action Blast     Action    Emma Davis     8.5
27    M014     Action Blast     Action    Emma Davis     8.3
28    M015       Family Fun     Family    Grace Chen     7.9
29    M015       Family Fun     Family    Grace Chen     8.1

In [201]:
data.groupby("Genre")['MovieID'].count()

Genre
Action       2
Adventure    2
Comedy       2
Drama        2
Family       2
Fantasy      2
Horror       2
Mystery      4
Romance      4
Sci-Fi       6
Thriller     2
Name: MovieID, dtype: int64

In [202]:
data.groupby("Genre")['Rating'].mean()

Genre
Action       8.400000
Adventure    8.650000
Comedy       7.650000
Drama        8.350000
Family       8.000000
Fantasy      9.050000
Horror       6.900000
Mystery      7.950000
Romance      8.050000
Sci-Fi       9.083333
Thriller     7.850000
Name: Rating, dtype: float64

In [206]:
data.iloc[data['Rating'].idxmax()]['Title']

'Sci-Fi Saga'

In [207]:
data.groupby("Director")['Rating'].mean()

Director
Alice Brown     9.083333
Carol Lee       7.916667
David Kim       8.050000
Emma Davis      8.025000
Frank Wilson    6.900000
Grace Chen      8.175000
Henry Patel     9.050000
John Smith      8.650000
Name: Rating, dtype: float64